Revit 2024 API
WireSize.Ampacity Property
 Get ampacity which be used for specifying size, the unit is ampere.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public long Ampacity { get; }
Visual Basic
Public ReadOnly Property Ampacity As Long
	Get
Visual C++
public:
property long long Ampacity {
	long long get ();
}
See Also
WireSize Class
Autodesk.Revit.DB.Electrical Namespace